In [ ]:

#################### Hypothesis Testing  Cutlets Example ######################

In [8]:
import pandas as pd 
import numpy as np
from scipy import stats

In [9]:
df=pd.read_csv("C:/Users/chopp/Downloads/Cutlets.csv")
df.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [10]:

stats.shapiro(df["Unit A"])
stats.shapiro(df["Unit B"])

ShapiroResult(statistic=0.9727305769920349, pvalue=0.5225146412849426)

In [11]:
stats.ttest_rel(df["Unit A"], df["Unit B"])

TtestResult(statistic=0.7536787225614316, pvalue=0.4562300768038412, df=34)

In [12]:

pvalue=0.45
alpha=0.5

In [13]:

if pvalue < alpha:
    print("We reject Null Hypothesis there is a significance difference between two Units A and B")
else:
    print("We fail to reject Null hypothesis")

We reject Null Hypothesis there is a significance difference between two Units A and B

In [ ]:
################# Hypothesis Testing  LabTAT Example ######################

In [14]:

import pandas as pd
import numpy as np
from scipy import stats

In [15]:

df=pd.read_csv("C:/Users/chopp/Downloads/LabTAT.csv")
df.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [16]:
df.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [17]:
stats.shapiro(df["Laboratory 1"])
stats.shapiro(df["Laboratory 2"])
stats.shapiro(df["Laboratory 3"])
stats.shapiro(df["Laboratory 4"])

ShapiroResult(statistic=0.9913760423660278, pvalue=0.6619619131088257)

In [18]:
stats.levene(df["Laboratory 1"], df["Laboratory 2"],df["Laboratory 3"],df["Laboratory 4"])

LeveneResult(statistic=2.599642500418024, pvalue=0.05161343808309816)

In [19]:

alpha = 0.05
pvalue=0.05
if pvalue <= alpha:
    print('We reject Null Hypothesis there is a significance difference between TAT of reports of the laboratories')
else:
    print('We fail to reject Null hypothesis')

We reject Null Hypothesis there is a significance difference between TAT of reports of the laboratories

In [ ]:

####################### Hypothesis Testing  Costomer+Order Example ############

In [20]:

import pandas as pd
import numpy as np
from scipy import stats

df=pd.read_csv("C:/Users/chopp/Downloads/Costomer+OrderForm.csv")
df.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [21]:
df.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

In [22]:
stats.chi2_contingency([df['Phillippines'].value_counts(), df['Indonesia'].value_counts(), df['Malta'].value_counts(), df['India'].value_counts()])

Chi2ContingencyResult(statistic=3.8589606858203545, pvalue=0.2771020991233144, dof=3, expected_freq=array([[271.75,  28.25],
       [271.75,  28.25],
       [271.75,  28.25],
       [271.75,  28.25]]))

In [23]:
alpha = 0.05
pvalue=0.28
if pvalue <= alpha:
    print('We reject Null Hypothesis there is a significance difference between customer and order')
else:
    print('We fail to reject Null hypothesis')

We fail to reject Null hypothesis

In [ ]:
####################### Hypothesis Testing BuyerRatio Example ############

In [24]:
import pandas as pd
import numpy as np
from scipy import stats

In [25]:
df=pd.read_csv("C:/Users/chopp/Downloads/BuyerRatio.csv")
df.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [26]:
df.describe()

             East         West        North       South
count    2.000000     2.000000     2.000000    2.000000
mean   242.500000   832.500000   743.500000  410.000000
std    272.236111   976.514465   866.205807  480.832611
min     50.000000   142.000000   131.000000   70.000000
25%    146.250000   487.250000   437.250000  240.000000
50%    242.500000   832.500000   743.500000  410.000000
75%    338.750000  1177.750000  1049.750000  580.000000
max    435.000000  1523.000000  1356.000000  750.000000

In [27]:
stats.chi2_contingency([df["East"], df["West"], df["North"], df["South"]])

Chi2ContingencyResult(statistic=1.5959455386610577, pvalue=0.6603094907091882, dof=3, expected_freq=array([[  42.76531299,  442.23468701],
       [ 146.81287862, 1518.18712138],
       [ 131.11756787, 1355.88243213],
       [  72.30424052,  747.69575948]]))

In [28]:
alpha = 0.05
pvalue=0.66
if pvalue <= alpha:
    print('We reject Null Hypothesis there is a significance of BuyerRatio')
else:
    print('We fail to reject Null hypothesis')

We fail to reject Null hypothesis